Importing libraries

In [73]:
import pandas as pd
import numpy as np
from sklearn.neighbors import KNeighborsClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix , accuracy_score
from sklearn import metrics

Load the Dataset

In [54]:
data = pd.read_csv("iphone_purchase_records.csv")

In [55]:
data.head()

   Gender  Age  Salary  Purchase Iphone
0    Male   19   19000                0
1    Male   35   20000                0
2  Female   26   43000                0
3  Female   27   57000                0
4    Male   19   76000                0

In [56]:
data.shape

(400, 4)

Check the missing values

In [57]:
data.isnull().sum()

Gender             0
Age                0
Salary             0
Purchase Iphone    0
dtype: int64

No null values in the datasets

Converting the categorical text column (Gender) into numerical column

In [58]:
data.replace({"Gender":{"Female":0,"Male":1}},inplace=True)

In [59]:
data.head()

   Gender  Age  Salary  Purchase Iphone
0       1   19   19000                0
1       1   35   20000                0
2       0   26   43000                0
3       0   27   57000                0
4       1   19   76000                0

Spliting the dataset into features & Target

In [60]:
x = data.drop(columns="Purchase Iphone",axis=1)
y = data["Purchase Iphone"]

In [61]:
x

     Gender  Age  Salary
0         1   19   19000
1         1   35   20000
2         0   26   43000
3         0   27   57000
4         1   19   76000
..      ...  ...     ...
395       0   46   41000
396       1   51   23000
397       0   50   20000
398       1   36   33000
399       0   49   36000

[400 rows x 3 columns]

In [62]:
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchase Iphone, Length: 400, dtype: int64

Spliting the dataset into train test split

In [63]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=2)

In [64]:
print(x.shape)
print(x_train.shape)
print(x_test.shape)

(400, 3)
(320, 3)
(80, 3)

In [65]:
model = KNeighborsClassifier(n_neighbors=3)
print("Model is loaded")

Model is loaded

In [66]:
model_fitted = model.fit(x_train,y_train)
print("Model is trainned")

Model is trainned

In [67]:
pred = model_fitted.predict(x_test)

In [68]:
print(pred)

[0 0 0 0 1 0 0 0 0 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 1 0 1 1 0
 1 0 1 1 0 0 0 0 0 0 1 1 0 1 1 0 0 1 0 1 1 1 0 0 1 1 0 1 1 1 0 0 1 0 1 0 0
 1 0 1 0 1 0]

Checking the Accuracy of training data & testing dataset

In [69]:
acc_train = model_fitted.score(x_train,y_train)

In [70]:
acc_train

0.875

In [75]:
### Checking the confusion matrixs
confusion_matric = metrics.confusion_matrix(y_test,pred)
print(f"confusion Matrix:{confusion_matric}")
### Checking the Accuracy 
accuracy = accuracy_score(y_test,pred)
print(f"Accuracy:{accuracy}")

confusion Matrix:[[41  7]
 [ 9 23]]
Accuracy:0.8

In [ ]:
print(f"Actual":)

In [72]:
### How to chose the value of k 
###1.sqrt(n)
###2.Error method - which is used

In [44]:
import math

In [45]:
math.sqrt(318)  ### chose k=17

17.832554500127006

In [46]:
Error = []
k = []
for i in range(1,21):
    model = KNeighborsClassifier(n_neighbors=i)
    model_fitted = model.fit(x_train,y_train)
    error = 1-round(model_fitted.score(x_train,y_train),2)
    Error.append(error)
    k.append(i)

In [47]:
pd.DataFrame({"k":k,"Error":Error})  ### k = 3

     k  Error
0    1   0.00
1    2   0.11
2    3   0.12
3    4   0.12
4    5   0.13
5    6   0.14
6    7   0.14
7    8   0.15
8    9   0.13
9   10   0.14
10  11   0.15
11  12   0.16
12  13   0.16
13  14   0.17
14  15   0.18
15  16   0.19
16  17   0.15
17  18   0.17
18  19   0.18
19  20   0.20